## Part I: Exploratory analysis (3 points)

Read the dataset correctly using pandas, using an appropriate column as index (1 point)

In [2]:
import pandas as pd

df = pd.read_csv('train.csv', index_col='PassengerId')
df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df.sample(20)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
485,1,1,"Bishop, Mr. Dickinson H",male,25.0,1,0,11967,91.0792,B49,C
62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0000,B28,NaN
838,0,3,"Sirota, Mr. Maurice",male,NaN,0,0,392092,8.0500,NaN,S
620,0,2,"Gavey, Mr. Lawrence",male,26.0,0,0,31028,10.5000,NaN,S
326,1,1,"Young, Miss. Marie Grice",female,36.0,0,0,PC 17760,135.6333,C32,C
768,0,3,"Mangan, Miss. Mary",female,30.5,0,0,364850,7.7500,NaN,Q
136,0,2,"Richard, Mr. Emile",male,23.0,0,0,SC/PARIS 2133,15.0458,NaN,C
603,0,1,"Harrington, Mr. Charles H",male,NaN,0,0,113796,42.4000,NaN,S
580,1,3,"Jussila, Mr. Eiriik",male,32.0,0,0,STON/O 2. 3101286,7.9250,NaN,S
586,1,1,"Taussig, Miss. Ruth",female,18.0,0,2,110413,79.6500,E68,S
447,1,2,"Mellinger, Miss. Madeleine Violet",female,13.0,0,1,250644,19.5000,NaN,S
506,0,1,"Penasco y Castellana, Mr. Victor de Satode",male,18.0,1,0,PC 17758,108.9000,C65,C
628,1,1,"Longley, Miss. Gretchen Fiske",female,21.0,0,0,13502,77.9583,D9,S
428,1,2,"Phillips, Miss. Kate Florence (""Mrs Kate Louis...",female,19.0,0,0,250655,26.0000,NaN,S
413,1,1,"Minahan, Miss. Daisy E",female,33.0,1,0,19928,90.0000,C78,Q
251,0,3,"Reed, Mr. James George",male,NaN,0,0,362316,7.2500,NaN,S
555,1,3,"Ohman, Miss. Velin",female,22.0,0,0,347085,7.7750,NaN,S
181,0,3,"Sage, Miss. Constance Gladys",female,NaN,8,2,CA. 2343,69.5500,NaN,S
67,1,2,"Nye, Mrs. (Elizabeth Ramell)",female,29.0,0,0,C.A. 29395,10.5000,F33,S
110,1,3,"Moran, Miss. Bertha",female,NaN,1,0,371110,24.1500,NaN,Q

Compute the percentage of survivors out of total number of passengers...

In [5]:
total = df.shape[0]
survivors = df[df['Survived'] == 1].shape[0]
survivors_per = survivors/total
print(f"Percentage of survivors: {round(survivors_per*100,2)}%")

Percentage of survivors: 38.38%

...and the percentage of men and women out of total number of passengers (0.5 points)

In [6]:
men = df[df['Sex'] == 'male'].shape[0]
woman = df[df['Sex'] == 'female'].shape[0]
men_per = men/total
woman_per = woman/total
print(f"Percentage of male: {round(men_per*100,2)}%")
print(f"Percentage of female: {round(woman_per*100,2)}%")

Percentage of male: 64.76%
Percentage of female: 35.24%

Compute the percentage of survivors by sex (i.e. the percentage of male passengers that survived and female passengers that survived)...

In [7]:
surv_men = df[(df['Sex'] == 'male') & (df['Survived'] == 1)].shape[0]
surv_woman = df[(df['Sex'] == 'female') & (df['Survived'] == 1)].shape[0]

surv_men_per = surv_men / men
surv_woman_per = surv_woman / woman
print(f"Percentage of male passengers who survived: {round(surv_men_per*100,2)}%")
print(f"Percentage of female passengers who survived: {round(surv_woman_per*100,2)}%")

Percentage of male passengers who survived: 18.89%
Percentage of female passengers who survived: 74.2%

...and the sex distribution of survivors (i.e. percentage of survivors that were men and percentage of survivors that were women) (0.5 points)

In [8]:
male_surv_per = (surv_men / survivors)
female_surv_per = (surv_woman / survivors)
print(f"Percentage of survivors who were men: {round(male_surv_per * 100, 2)}%")
print(f"Percentage of survivors who were women: {round(female_surv_per * 100, 2)}%")

Percentage of survivors who were men: 31.87%
Percentage of survivors who were women: 68.13%

Display in a 2 x 2 DataFrame the probability of being male/female and surviving/not surviving (0.5 points)

One possible option:

|            | **Survived**      | **Not survived**      |
|------------|-------------------|-----------------------|
| **Male**   | Male & Survived   | Male & Not survived   |
| **Female** | Female & Survived | Female & Not survived |

Notice that the sum of all values in the table above should be 1 (or 100 %).

In [9]:
sex_and_survived = df.groupby(['Sex', 'Survived']).size()

prob = sex_and_survived / total

prob = prob.unstack()
prob = prob.rename(columns={0: 'Not Survived', 1: 'Survived'})
prob

Survived  Not Survived  Survived
Sex
female        0.090909  0.261504
male          0.525253  0.122334

Display in a DataFrame the probability of survival/not survival of all combinations of sex and class (0.5 points)

One possible option:

|            |   | **Survived**              | **Not survived** |
|------------|---|---------------------------|------------------|
| **Male**   | 1 | Male & Survived & Class 1 | ...              |
|            | 2 | Male & Survived & Class 2 | ...              |
|            | 3 | Male & Survived & Class 3 | ...              |
| **Female** | 1 | ...                       | ...              |
|            | 2 | ...                       | ...              |
|            | 3 | ...                       | ...              |

Notice that the sum of all values in the table above should be 1 (or 100 %).

In [10]:
total_prob = df.groupby(['Sex', 'Pclass', 'Survived']).size()
prob2 = total_prob / total
prob2 = prob2.unstack()
prob2 = prob2.rename(columns={0: 'Not Survived', 1: 'Survived'})
prob2

Survived       Not Survived  Survived
Sex    Pclass
female 1           0.003367  0.102132
       2           0.006734  0.078563
       3           0.080808  0.080808
male   1           0.086420  0.050505
       2           0.102132  0.019080
       3           0.336700  0.052750

## Part II: More insights on the data (3 points)

Present 3 insights about the dataset, each of them relating at least 3 different variables, and support them by code and numbers. Possible examples:

- "**Men** aged **less than 18** were more/less likely to **survive** than the average passenger" (Sex, Age, Survival)
- "**Women** with **no siblings or spouses** paid on average a cheaper/pricier **ticket** than the average woman" (Sex, SibSp, Fare)
- "**Men** with a **title other than Mr.** were more/less likely to have a known (i.e. non-missing) **cabin** than the average man" (Sex, Name, Cabin)

(Using these exact examples is valid, but awards fewer points than proposing original insights)

_Hint: If you want to work with lists and dictionaries rather than pandas objects, you can do_

```python
recs = df.to_dict(orient="records")
```

Data description:
Survival - Survival (0 = No; 1 = Yes)
Pclass - Passenger Class (1 = 1st; 2 = 2nd; 3 = 3rd)
Name - Name
Sex - Sex
Age - Age
Sibsp - Number of Siblings/Spouses Aboard
Parch - Number of Parents/Children Aboard
Ticket - Ticket Number
Fare - Passenger Fare
Cabin - Cabin
Embarked - Port of Embarkation (C = Cherbourg; Q = Queenstown; S = Southampton)

In [11]:
df.head(1)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [13]:
embarked = df.groupby(['Embarked', 'Sex', 'Survived']).size()
embarked = (embarked / total ) * 100
embarked = embarked.unstack()

embarked

Survived                 0          1
Embarked Sex
C        female   1.010101   7.182941
         male     7.407407   3.254770
Q        female   1.010101   3.030303
         male     4.264871   0.336700
S        female   7.070707  15.712682
         male    40.852974   8.641975

In [15]:
row_totals = embarked.sum(axis=1)
column_totals = embarked.sum()

embarked.loc['Total'] = column_totals
embarked['Total'] = row_totals
embarked

Survived              0          1      Total
(C, female)    1.010101   7.182941  16.386083
(C, male)      7.407407   3.254770  21.324355
(Q, female)    1.010101   3.030303   8.080808
(Q, male)      4.264871   0.336700   9.203143
(S, female)    7.070707  15.712682  45.566779
(S, male)     40.852974   8.641975  98.989899
Total        123.232323  76.318743  99.775533

In [16]:
embarked = df.groupby(['Embarked', 'Survived']).size().unstack()
total_per_embarked = df.groupby('Embarked').size()
embarked_probability = embarked.apply(lambda x: (x / total_per_embarked[x.name]) * 100, axis=1)
embarked_probability

Survived          0          1
Embarked
C         44.642857  55.357143
Q         61.038961  38.961039
S         66.304348  33.695652

In [16]:
print('After a research on the Internet looking for the documentation of the dataset, we know the following:')
print('''
- Data description:
    * Survival - Survival (0 = No; 1 = Yes)
    * Pclass - Passenger Class (1 = 1st; 2 = 2nd; 3 = 3rd)
    * Name - Name
    * Sex - Sex
    * Age - Age
    * Sibsp - Number of Siblings/Spouses Aboard
    * Parch - Number of Parents/Children Aboard
    * Ticket - Ticket Number
    * Fare - Passenger Fare
    * Cabin - Cabin
    * Embarked - Port of Embarkation (C = Cherbourg; Q = Queenstown; S = Southampton)''')

After a research on the Internet looking for the documentation of the dataset, we know the following:

- Data description:
    * Survival - Survival (0 = No; 1 = Yes)
    * Pclass - Passenger Class (1 = 1st; 2 = 2nd; 3 = 3rd)
    * Name - Name
    * Sex - Sex
    * Age - Age
    * Sibsp - Number of Siblings/Spouses Aboard
    * Parch - Number of Parents/Children Aboard
    * Ticket - Ticket Number
    * Fare - Passenger Fare
    * Cabin - Cabin
    * Embarked - Port of Embarkation (C = Cherbourg; Q = Queenstown; S = Southampton)

In [17]:
print("Insight 1:")
print(" After analyzing the relation between Port of Embarkation, Sex and Survival, we conclude:")
print(" - Overall Survival: Survival rates were highest for passengers who embarked from Cherbourg (55.36%), followed by Queenstown (38.96%) and Southampton (33.70%).")
print(" - Gender Influence: In all ports, female passengers had a higher survival rate than males.")
print(" - Port & Gender: Cherbourg had the highest survival rates for both genders, while Southampton had the most passengers.")

Insight 1:
 After analyzing the relation between Port of Embarkation, Sex and Survival, we conclude:
 - Overall Survival: Survival rates were highest for passengers who embarked from Cherbourg (55.36%), followed by Queenstown (38.96%) and Southampton (33.70%).
 - Gender Influence: In all ports, female passengers had a higher survival rate than males.
 - Port & Gender: Cherbourg had the highest survival rates for both genders, while Southampton had the most passengers.

In [21]:
df2 = df.copy()
df2['Surname'] = df2['Name'].str.split(',').str[0].str.strip()
df2['FamilyMembers'] = df2['SibSp'] + df2['Parch']
df2.sort_values(by=['Surname', 'FamilyMembers'], inplace=True)

family_tree = pd.DataFrame(columns=['Father', 'Mother', 'Siblings', 'Survival %'])

all_survived = all_died = father_died = mother_died = father_mother_died = siblings_survived = mother_father_survived_siblings_not = 0
no_siblings = no_parents = 0

for surname, group in df2.groupby('Surname'):
    father = mother = siblings = None

    male_members = group[group['Sex'] == 'male']
    if not male_members.empty:
        father = male_members.iloc[0]['Name']
        father_survival_percentage = male_members['Survived'].mean() * 100

    female_members = group[group['Sex'] == 'female']
    if not female_members.empty:
        mother = female_members.iloc[0]['Name']
        mother_survival_percentage = female_members['Survived'].mean() * 100

    sibling_members = group[group['Age'].notna()].sort_values(by='Age')
    if len(sibling_members) > 0:
        siblings = sibling_members['Name'].tolist()
        siblings_survival_percentage = sibling_members['Survived'].mean() * 100

    family_survival_percentage = group['Survived'].mean() * 100

    family_tree.loc[surname] = [father, mother, siblings, family_survival_percentage]

    if family_survival_percentage == 100:
        all_survived += 1
    elif family_survival_percentage == 0:
        all_died += 1
    elif father and father_survival_percentage == 0:
        father_died += 1
    elif mother and mother_survival_percentage == 0:
        mother_died += 1
    elif father and mother and father_survival_percentage == 0 and mother_survival_percentage == 0 and siblings_survival_percentage == 100:
        father_mother_died += 1
    elif mother and father_survival_percentage == 100 and mother_survival_percentage == 100 and siblings_survival_percentage < 100:
        mother_father_survived_siblings_not += 1
    elif siblings_survival_percentage == 100:
        siblings_survived += 1

    if len(sibling_members) == 0:
        no_siblings += 1

    if len(male_members) == 0 and len(female_members) == 0:
        no_parents += 1

In [22]:
family_tree

,Father,Mother,Siblings,Survival %
Abbing,"Abbing, Mr. Anthony",None,"[Abbing, Mr. Anthony]",0.0
Abbott,"Abbott, Mr. Rossmore Edward","Abbott, Mrs. Stanton (Rosa Hunt)","[Abbott, Mr. Rossmore Edward, Abbott, Mrs. Sta...",50.0
Abelson,"Abelson, Mr. Samuel","Abelson, Mrs. Samuel (Hannah Wizosky)","[Abelson, Mrs. Samuel (Hannah Wizosky), Abelso...",50.0
Adahl,"Adahl, Mr. Mauritz Nils Martin",None,"[Adahl, Mr. Mauritz Nils Martin]",0.0
Adams,"Adams, Mr. John",None,"[Adams, Mr. John]",0.0
...,...,...,...,...
de Mulder,"de Mulder, Mr. Theodore",None,"[de Mulder, Mr. Theodore]",100.0
de Pelsmaeker,"de Pelsmaeker, Mr. Alfons",None,"[de Pelsmaeker, Mr. Alfons]",0.0
del Carlo,"del Carlo, Mr. Sebastiano",None,"[del Carlo, Mr. Sebastiano]",0.0
van Billiard,"van Billiard, Mr. Austin Blyler",None,"[van Billiard, Mr. Austin Blyler]",0.0
van Melkebeke,"van Melkebeke, Mr. Philemon",None,None,0.0

In [23]:
print("Insight 2:")
print(" After analyzing the relation between Surname, SibSp Parch, we conclude that:\n")
print(" - Total number of passengers:", total)
print(" - Total number of families:", len(family_tree))
print(" - Number of families where all members survived:", all_survived)
print(" - Number of families where all members died:", all_died)
print(" - Number of families where the father died:", father_died)
print(" - Number of families where the mother died:", mother_died)
print(" - Number of families where the father and mother died, and siblings survived:", father_mother_died)
print(" - Number of families where the mother and father survived, but siblings did not:", mother_father_survived_siblings_not)
print(" - Number of families without siblings:", no_siblings)
print(" - Number of children without parents:", no_parents)

Insight 2:
 After analyzing the relation between Surname, SibSp Parch, we conclude that:

 - Total number of passengers: 891
 - Total number of families: 667
 - Number of families where all members survived: 224
 - Number of families where all members died: 387
 - Number of families where the father died: 38
 - Number of families where the mother died: 2
 - Number of families where the father and mother died, and siblings survived: 0
 - Number of families where the mother and father survived, but siblings did not: 0
 - Number of families without siblings: 132
 - Number of children without parents: 0

In [25]:
group = df.groupby(['Embarked', 'Pclass', 'Sex'])['Fare'].mean()
group

Embarked  Pclass  Sex
C         1       female    115.640309
                  male       93.536707
          2       female     25.268457
                  male       25.421250
          3       female     14.694926
                  male        9.352237
Q         1       female     90.000000
                  male       90.000000
          2       female     12.350000
                  male       12.350000
          3       female     10.307833
                  male       11.924251
S         1       female     99.026910
                  male       52.949947
          2       female     21.912687
                  male       19.232474
          3       female     18.670077
                  male       13.307149
Name: Fare, dtype: float64

In [28]:
female_fares = group.loc[:, :, 'female']
male_fares = group.loc[:, :, 'male']

percentage_difference = (female_fares - male_fares) / male_fares * 100
percentage_difference

Embarked  Pclass
C         1         23.630939
          2         -0.601044
          3         57.127388
Q         1          0.000000
          2          0.000000
          3        -13.555719
S         1         87.019849
          2         13.935869
          3         40.301106
Name: Fare, dtype: float64

In [30]:
print("Insight 3:")
print(" After analyzing the relation between Port Embarked, Sex, Pclass and Fares, we conclude that:\n")
print(" - Cherbourg: Women in 1st and 3rd class paid 23.63% and 57.13% more respectively, while in 2nd class they paid 0.60% less than men.")
print(" - Queenstown: Fares were equal for men and women in 1st and 2nd class, but women in 3rd class paid 13.56% less.")
print(" - Southampton: Women paid more across all classes, with the highest difference in 1st class (87.02%).")

Insight 3:
 After analyzing the relation between Port Embarked, Sex, Pclass and Fares, we conclude that:

 - Cherbourg: Women in 1st and 3rd class paid 23.63% and 57.13% more respectively, while in 2nd class they paid 0.60% less than men.
 - Queenstown: Fares were equal for men and women in 1st and 2nd class, but women in 3rd class paid 13.56% less.
 - Southampton: Women paid more across all classes, with the highest difference in 1st class (87.02%).